### Setting Up

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
#test
test = pd.read_sql_query('SELECT * FROM category', engine)
test.head()

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27
2            3   Children 2006-02-15 04:46:27
3            4   Classics 2006-02-15 04:46:27
4            5     Comedy 2006-02-15 04:46:27

### 1) How many distinct (different) actors' last names are there?

In [6]:
query1='SELECT COUNT(DISTINCT last_name) AS amount_surnames FROM sakila.actor;'
pd.read_sql_query(query1, engine)

   amount_surnames
0              121

### 2) Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [18]:
query2= '''SELECT *,
     CASE
     WHEN (weekday(rental_date) BETWEEN 1 AND 5 ) THEN 'Weekday'
     ELSE 'Weekend'
     END AS 'day_type'
FROM sakila.rental;'''
pd.read_sql_query(query2, engine)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Weekday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Weekday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Weekday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Weekday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Weekday
...,...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53,Weekday
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53,Weekday
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53,Weekday
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53,Weekday
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53,Weekday

### 3) Get all films with ARMAGEDDON in the title.

In [22]:
query3='''SELECT * FROM sakila.film_text WHERE title LIKE "%%ARMAGEDDON%%";'''
pd.read_sql_query(query3, engine)

   film_id            title                                        description
0       39  ARMAGEDDON LOST  A Fast-Paced Tale of a Boat And a Teacher who ...

### 4) Get 10 the longest films.

In [23]:
query4='''SELECT title, length
FROM sakila.film 
ORDER BY length 
DESC LIMIT 10;'''
pd.read_sql_query(query4, engine)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

### 5) How many films include Behind the Scenes content?

In [25]:
query5='''SELECT COUNT(title) 
FROM sakila.film 
WHERE special_features LIKE '%%Behind the Scenes%%';'''
pd.read_sql_query(query5, engine)

   COUNT(title)
0           538

### 6) Which kind of movies (rating) have a mean duration of more than two hours?

In [27]:
query6='''SELECT rating, AVG(length) AS mean_length
FROM sakila.film
GROUP BY rating
HAVING AVG(length) > 120;'''
pd.read_sql_query(query6, engine)

  rating  mean_length
0  PG-13     120.4439

### 7) Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [28]:
query7='''SELECT title, length,
	DENSE_RANK() OVER (ORDER BY length DESC) as ranking
FROM sakila.film
WHERE length IS NOT NULL
ORDER BY length DESC;'''
pd.read_sql_query(query7, engine)

                   title  length  ranking
0          CHICAGO NORTH     185        1
1         CONTROL ANTHEM     185        1
2         DARN FORRESTER     185        1
3            GANGS PRIDE     185        1
4              HOME PITY     185        1
..                   ...     ...      ...
995         ALIEN CENTER      46      140
996            IRON MOON      46      140
997        KWAI HOMEWARD      46      140
998     LABYRINTH LEAGUE      46      140
999  RIDGEMONT SUBMARINE      46      140

[1000 rows x 3 columns]